In [1]:
import numpy as np
import pandas as pd

In [2]:
#countries and their gdp
countries=np.array(['Algeria','Angola','Argentina','Australia','Austria','Bahamas',
                    'Bangladesh','Belarus','Belgium','Bhutan','Brazil','Bulgaria',
                    'Cambodia','Cameroon','Chile','China','Colombia','Cyprus',
                    'Denmark','El Salvador','Estonia','Ethiopia','Fiji','Finland',
                    'France','Georgia','Ghana','Grenada','Guinea','Haiti','Honduras',
                    'Hungary','India','Indonesia','Ireland','Italy','Japan','Kenya', 
                    'South Korea','Liberia','Malaysia','Mexico', 'Morocco','Nepal','New Zealand',
                    'Norway','Pakistan', 'Peru','Qatar',
                    'Russia','Singapore','South Africa','Spain','Sweden','Switzerland','Thailand',
                    'United Arab Emirates','United Kingdom',
                    'United States','Uruguay','Venezuela','Vietnam','Zimbabwe'])
gdp=np.array([2255.225482,629.9553062,11601.63022,25306.82494,27266.40335,19466.99052,588.3691778,
              2890.345675,24733.62696,1445.760002,4803.398244,2618.876037,590.4521124,665.7982328,
              7122.938458,2639.54156,3362.4656,15378.16704,30860.12808,2579.115607,6525.541272,
              229.6769525,2242.689259,27570.4852,23016.84778,1334.646773,402.6953275,6047.200797,
              394.1156638,385.5793827,1414.072488,5745.981529,837.7464011,1206.991065,27715.52837,
              18937.24998,39578.07441,478.2194906,16684.21278,279.2204061,5345.213415,6288.25324,
              1908.304416,274.8728621,14646.42094,40034.85063,672.1547506,3359.517402,36152.66676,
              3054.727742,33529.83052,3825.093781,15428.32098,33630.24604,39170.41371,2699.123242,
              21058.43643,28272.40661,37691.02733,9581.05659,5671.912202,757.4009286,347.7456605])

#heights
heights = [189, 170, 189, 163, 183, 171, 185, 168, 173, 183, 173, 173, 175, 178, 183, 193, 178, 173,
           174, 183, 183, 180, 168, 180, 170, 178, 182, 180, 183, 178, 182, 188, 175, 179,
           183, 193, 182, 183, 177, 185, 188, 188, 182, 185, 191]

#ages
ages = [57, 61, 57, 57, 58, 57, 61, 54, 68, 51, 49, 64, 50, 48, 65, 52, 56, 46, 54, 49,
        51, 47, 55,
        55, 54, 42, 51, 56, 55, 51, 54, 51, 60, 62, 43, 55, 56, 61, 52, 69, 64, 46, 54,
        47, 70]
dfPresidentName=pd.DataFrame({
    'First':['George','Bill','Ronald','Jimmy','George'],
    'Second':['Bush','Clinton','Regan','Carter','Washington']}
,index=[1,2,3,4,7]
)

In [3]:
f_series=pd.Series(list('abcdef'))

In [4]:
print(f_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [5]:
s_countries=pd.Series(countries)
print(s_countries)

0           Algeria
1            Angola
2         Argentina
3         Australia
4           Austria
          ...
58    United States
59          Uruguay
60        Venezuela
61          Vietnam
62         Zimbabwe
Length: 63, dtype: object

In [6]:
dict_countries_gdp=pd.Series(gdp,index=countries)
print(dict_countries_gdp)

Algeria           2255.225482
Angola             629.955306
Argentina        11601.630220
Australia        25306.824940
Austria          27266.403350
                     ...
United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
Length: 63, dtype: float64

In [7]:
dict_countries_gdp[0:5]

Algeria       2255.225482
Angola         629.955306
Argentina    11601.630220
Australia    25306.824940
Austria      27266.403350
dtype: float64

In [8]:
dict_countries_gdp.loc['United States']

37691.02733

In [9]:
dict_countries_gdp.iloc[0]

2255.225482

In [10]:
scalar_s=pd.Series(7,index=['a','b','c','d','e'])

In [11]:
scalar_s

a    7
b    7
c    7
d    7
e    7
dtype: int64

In [12]:
#creating a dataframe from a list
myList={'HostCity':['London','Beijing','Athens','Sydney','Atlanta',],'Year':[2012,2008,2004,2000,1996],
        'No.OfParticipating Countries':[205,204,201,200,1996]}

In [13]:
myList_pd=pd.DataFrame(myList)

In [14]:
myList_pd

  HostCity  Year  No.OfParticipating Countries
0   London  2012                           205
1  Beijing  2008                           204
2   Athens  2004                           201
3   Sydney  2000                           200
4  Atlanta  1996                          1996

In [15]:
myList_pd[myList_pd['No.OfParticipating Countries']>201]

  HostCity  Year  No.OfParticipating Countries
0   London  2012                           205
1  Beijing  2008                           204
4  Atlanta  1996                          1996

In [16]:
myList_pd.iloc[0:3]

  HostCity  Year  No.OfParticipating Countries
0   London  2012                           205
1  Beijing  2008                           204
2   Athens  2004                           201

In [17]:
myList_pd.loc[1]

HostCity                        Beijing
Year                               2008
No.OfParticipating Countries        204
Name: 1, dtype: object

In [18]:
myList_pd.iat[3,1]

2000

In [19]:
print("Bottom 3:\n{}".format(myList_pd.tail(3)))
print("\nColumns:\n{}".format(myList_pd.columns))
print("Index:\n{}".format(myList_pd.index))

Bottom 3:
  HostCity  Year  No.OfParticipating Countries
2   Athens  2004                           201
3   Sydney  2000                           200
4  Atlanta  1996                          1996

Columns:
Index(['HostCity', 'Year', 'No.OfParticipating Countries'], dtype='object')
Index:
RangeIndex(start=0, stop=5, step=1)

In [20]:
print("Head:\n".format(myList_pd.head(3)))
print("No.Of Partipating countries column:\n{}"
      .format(myList_pd['No.OfParticipating Countries']))

Head:

No.Of Partipating countries column:
0     205
1     204
2     201
3     200
4    1996
Name: No.OfParticipating Countries, dtype: int64

In [21]:
myList2={'London':{2008:888,2012:205},'Beijing':{2008:204}}

In [22]:
myList2_pd=pd.DataFrame(myList2)

In [23]:
myList2_pd

      London  Beijing
2008     888    204.0
2012     205      NaN

In [24]:
myList2_pd.describe

<bound method NDFrame.describe of       London  Beijing
2008     888    204.0
2012     205      NaN>

In [25]:
#crating a dataframe from an ndarray
n2_arr=np.array([2012,2008,2004,2006])
dict_arr={'year':n2_arr}
d_arr=pd.DataFrame(dict_arr)

In [26]:
d_arr

   year
0  2012
1  2008
2  2004
3  2006

In [27]:
f_s=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [28]:
s_s=pd.Series([10,20,30,40,50],index=['n','b','c','d','e'])

In [29]:
sum_s=f_s+s_s
sum_s

a     NaN
b    22.0
c    33.0
d    44.0
e    55.0
n     NaN
dtype: float64

In [30]:
dropna_s=sum_s.dropna()
dropna_s

b    22.0
c    33.0
d    44.0
e    55.0
dtype: float64

In [31]:
fillna_s=sum_s.fillna(0)

In [32]:
fillna_s=sum_s.fillna(0)
fillna_s

a     0.0
b    22.0
c    33.0
d    44.0
e    55.0
n     0.0
dtype: float64

In [33]:
df_movieRating=pd.DataFrame(
    {'movie1':[5,4,3,3,2,1],
                            'movie2':[4,5,2,3,4,3]},
                            index=['Tom','Jeff','Peter','Rom','Ted','Paul']
                           )

In [34]:
def movieGrade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'c'
    if rating==2:
        return 'D'
    if rating==1:
        return 'F'

In [35]:
print(movieGrade(4))

B

In [36]:
df_movieRating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Rom         3       3
Ted         2       4
Paul        1       3

In [37]:
df_movieRating.applymap(movieGrade)

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      c      D
Rom        c      c
Ted        D      B
Paul       F      c

In [38]:
dfTestScores=pd.DataFrame(
    {'Test1':[77,65,54,89,99,73],
     'Test2':[88,77,88,90,66,76]},
index=['Jack','Lewis','Pat','Ric','kelly','Paula']
)

In [39]:
dfTestScores.max()

Test1    99
Test2    90
dtype: int64

In [40]:
dfTestScores.mean()

Test1    76.166667
Test2    80.833333
dtype: float64

In [41]:
#standard deviation
dfTestScores.std()

Test1    16.203909
Test2     9.432214
dtype: float64

In [42]:
# Variance
dfTestScores.var()

Test1    262.566667
Test2     88.966667
dtype: float64

In [43]:
dfPresidentName

    First      Second
1  George        Bush
2    Bill     Clinton
3  Ronald       Regan
4   Jimmy      Carter
7  George  Washington

In [44]:
grouped=dfPresidentName.groupby('First')

In [45]:
grpData=grouped.get_group('George')
grpData

    First      Second
1  George        Bush
7  George  Washington

In [46]:
def standardize_tests(test):
    return (test-test.mean())/test.std()

In [47]:
standardize_tests(dfTestScores['Test1'])

Jack     0.051428
Lewis   -0.689134
Pat     -1.367983
Ric      0.791990
kelly    1.409125
Paula   -0.195426
Name: Test1, dtype: float64

In [48]:
def standardize_tests_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [49]:
standardize_tests_scores(dfTestScores)

          Test1     Test2
Jack   0.051428  0.759807
Lewis -0.689134 -0.406409
Pat   -1.367983  0.759807
Ric    0.791990  0.971847
kelly  1.409125 -1.572625
Paula -0.195426 -0.512428

In [50]:
dfStudentMath=pd.DataFrame(
    {'Student':['Tom','Jack','Dan','Ram','David','David'],
     'ID':[10,56,31,12,22,22]
                           })

In [51]:
dfStudentScience=pd.DataFrame({
    'Student':['Tom','Ram','David'],
    'ID':[10,12,22]
})

In [52]:
# merge science with math
pd.merge(dfStudentMath,dfStudentScience)

  Student  ID
0     Tom  10
1     Ram  12
2   David  22
3   David  22

In [53]:
# merge with key on student
pd.merge(dfStudentMath,dfStudentScience,on='Student')

  Student  ID_x  ID_y
0     Tom    10    10
1     Ram    12    12
2   David    22    22
3   David    22    22

In [54]:
# merge left join on key id also fill nan values with X
pd.merge(dfStudentMath,dfStudentScience,on='ID',how='left').fillna('X')

  Student_x  ID Student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  12       Ram
4     David  22     David
5     David  22     David

In [55]:
# concatenation
pd.concat([dfStudentMath,dfStudentScience],ignore_index=True)

  Student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  12
4   David  22
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [56]:
# 
dStudentSurveyData=dfStudentMath
dStudentSurveyData

  Student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  12
4   David  22
5   David  22

In [57]:
# check duplicate
dStudentSurveyData.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [58]:
dStudentSurveyData.drop_duplicates('Student')

  Student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  12
4   David  22

In [59]:
dStudentSurveyData.drop_duplicates('ID')

  Student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  12
4   David  22